test.yml
settings:
  default-executor: siege

execution:
- concurrency: 100
  ramp-up: 1m
  hold-for: 5m
  scenario: quick-test

scenarios:
  quick-test:
    requests:
    - https://www.qa.rent.com/

reporting:
- module: final-stats
  summary: true
  percentiles: true
  failed-labels: false
  test-duration: true
  dump-xml: results.xml
  dump-csv: results.csv